# 原則、メインモジュールでファイルから読み込む
df_balance_type_and_category = None
df_balance_target = None
df_offset_unrealized = None
df_asset_type_and_category = None

df_target_balance_parameter = None
df_target_rate = None

df_target_initial_value = None

# 収支抽出条件マッピング
BALANCE_RULES = {
    # 一般収支
    "給与": [("中項目", "給与"),],
    "生活費": [
        ("内容", "フリカエ ペイペイ"),
        ("中項目", "交際費"),
        ("内容", "口座振替 PayPayカード"),
        ("内容", "ミツイスミトモカ-ド"),
        ("内容", "DCカ-ド"),
        ("内容", "口座振替 中部電力"),
        (("内容", "UC"), ("保有金融機関", "みずほ")),  # ダブル条件
    ],
    "子供費用": [("中項目", "詩乃の費用"),],
    "ローン返済": [("内容", "ジユウタクロ-ン"),],

    # 特別収支
    "賞与": [("内容", "賞与")],
    "贈与": [("内容", "タエコ")],
    "児童手当": [("内容", "ジドウテアテ")],
    "特典": [("中項目", "特典")],
    "所得税還付": [("中項目", "還付")],
    "子供": [("中項目", "詩乃の特別費⽤")],
    "家電": [("中項目", "家具・家電")],
    "ふるさと納税": [("中項目", "ふるさと納税")],
    "固定資産税": [("中項目", "固定資産税")],
    "自動車税": [("中項目", "自動車税")],
    # --- 未実装項目（将来用） ---
    # "退職金": [],
    # "NTT": [],
    # "車": [],
    # "車検A": [],
    # "車検B": [],
    # "ローン一括": [],
}